In [1]:
import numpy as np
import pandas as pd

In [4]:
 dataset = pd.read_csv("Customers.csv")

In [6]:
dataset.head()

,CustomerID,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size
0,1,Male,19,15000,39,Healthcare,1,4
1,2,Male,21,35000,81,Engineer,3,3
2,3,Female,20,86000,6,Engineer,1,1
3,4,Female,23,59000,77,Lawyer,0,2
4,5,Female,31,38000,40,Entertainment,2,6

In [10]:

dataset.shape

(2000, 8)

In [22]:

dataset.isnull()

,CustomerID,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...
1995,False,False,False,False,False,False,False,False
1996,False,False,False,False,False,False,False,False
1997,False,False,False,False,False,False,False,False
1998,False,False,False,False,False,False,False,False
1999,False,False,False,False,False,False,False,False

In [26]:
dataset.isnull().values.any()

True

In [30]:
dataset.isnull().sum()

CustomerID                 0
Gender                     0
Age                        0
Annual Income ($)          0
Spending Score (1-100)     0
Profession                35
Work Experience            0
Family Size                0
dtype: int64

In [36]:

dataset_ds = dataset.drop(columns=["Profession"])

In [44]:
dataset_ds.isnull().sum()

CustomerID                0
Gender                    0
Age                       0
Annual Income ($)         0
Spending Score (1-100)    0
Work Experience           0
Family Size               0
dtype: int64

In [50]:

dataset_ds.dtypes

CustomerID                 int64
Gender                    object
Age                        int64
Annual Income ($)          int64
Spending Score (1-100)     int64
Work Experience            int64
Family Size                int64
dtype: object

In [58]:

has_zero = (dataset_ds == 0).values.any()
has_zero

True

In [62]:
zero_counts = (dataset_ds == 0).sum()
zero_counts

CustomerID                  0
Gender                      0
Age                        24
Annual Income ($)           2
Spending Score (1-100)      2
Work Experience           431
Family Size                 0
dtype: int64

In [80]:
dataset_ds['Age'] = dataset_ds['Age'].replace(0, dataset_ds['Age'].mean())
(dataset_ds == 0).sum()

CustomerID                  0
Gender                      0
Age                         0
Annual Income ($)           2
Spending Score (1-100)      2
Work Experience           431
Family Size                 0
dtype: int64

In [92]:
dataset_ds['Age'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 2000 entries, 0 to 1999
Series name: Age
Non-Null Count  Dtype
--------------  -----
2000 non-null   int64
dtypes: int64(1)
memory usage: 15.8 KB

In [94]:

dataset_ds.iloc[0]

CustomerID                    1
Gender                     Male
Age                          19
Annual Income ($)         15000
Spending Score (1-100)       39
Work Experience               1
Family Size                   4
Name: 0, dtype: object

In [98]:
dataset_ds.iloc[2:6]

,CustomerID,Gender,Age,Annual Income ($),Spending Score (1-100),Work Experience,Family Size
2,3,Female,20,86000,6,1,1
3,4,Female,23,59000,77,0,2
4,5,Female,31,38000,40,2,6
5,6,Female,22,58000,76,0,2

In [102]:


dataset_ds['Age']

0       19
1       21
2       20
3       23
4       31
        ..
1995    71
1996    91
1997    87
1998    77
1999    90
Name: Age, Length: 2000, dtype: int64

In [114]:
sorted_ds = dataset_ds.sort_values(by="Age", ascending= False)
sorted_ds.head(10)

,CustomerID,Gender,Age,Annual Income ($),Spending Score (1-100),Work Experience,Family Size
1103,1104,Female,99,103706,50,1,2
1524,1525,Female,99,150782,18,8,2
1629,1630,Male,99,162762,52,1,1
361,362,Male,99,63364,61,1,2
1322,1323,Female,99,144176,74,7,2
1771,1772,Female,99,84167,46,10,7
1188,1189,Female,99,122548,14,2,5
1401,1402,Male,99,139685,20,1,4
1133,1134,Female,99,57677,99,0,5
351,352,Male,99,173394,4,13,1

In [116]:


dataset_ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 7 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              2000 non-null   int64
 1   Gender                  2000 non-null   object
 2   Age                     2000 non-null   int64
 3   Annual Income ($)       2000 non-null   int64
 4   Spending Score (1-100)  2000 non-null   int64
 5   Work Experience         2000 non-null   int64
 6   Family Size             2000 non-null   int64
dtypes: int64(6), object(1)
memory usage: 109.5+ KB

In [120]:
dataset_ds.describe()

,CustomerID,Age,Annual Income ($),Spending Score (1-100),Work Experience,Family Size
count,2000.000000,2000.000000,2000.000000,2000.000000,2000.000000,2000.000000
mean,1000.500000,49.536000,110731.821500,50.962500,4.102500,3.768500
std,577.494589,27.913263,45739.536688,27.934661,3.922204,1.970749
min,1.000000,1.000000,0.000000,0.000000,0.000000,1.000000
25%,500.750000,26.000000,74572.000000,28.000000,1.000000,2.000000
50%,1000.500000,48.000000,110045.000000,50.000000,3.000000,4.000000
75%,1500.250000,73.000000,149092.750000,75.000000,7.000000,5.000000
max,2000.000000,99.000000,189974.000000,100.000000,17.000000,9.000000

In [122]:
dataset_ds.dtypes

CustomerID                 int64
Gender                    object
Age                        int64
Annual Income ($)          int64
Spending Score (1-100)     int64
Work Experience            int64
Family Size                int64
dtype: object

In [124]:


unique_counts = dataset_ds['Age'].value_counts()
unique_counts

Age
48    44
31    31
32    30
52    30
91    29
      ..
10    12
42    12
77    12
71    12
98     9
Name: count, Length: 99, dtype: int64

In [136]:
unique_counts = dataset_ds['Gender'].value_counts()
unique_counts

Gender
Female    1186
Male       814
Name: count, dtype: int64

In [134]:
dataset_ds.nunique()

CustomerID                2000
Gender                       2
Age                         99
Annual Income ($)         1786
Spending Score (1-100)     101
Work Experience             18
Family Size                  9
dtype: int64

In [138]:
dataset_ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 7 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              2000 non-null   int64
 1   Gender                  2000 non-null   object
 2   Age                     2000 non-null   int64
 3   Annual Income ($)       2000 non-null   int64
 4   Spending Score (1-100)  2000 non-null   int64
 5   Work Experience         2000 non-null   int64
 6   Family Size             2000 non-null   int64
dtypes: int64(6), object(1)
memory usage: 109.5+ KB

In [140]:


dataset_ds['Work Experience'] = dataset_ds['Work Experience'].astype('int32')
dataset_ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 7 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              2000 non-null   int64
 1   Gender                  2000 non-null   object
 2   Age                     2000 non-null   int64
 3   Annual Income ($)       2000 non-null   int64
 4   Spending Score (1-100)  2000 non-null   int64
 5   Work Experience         2000 non-null   int32
 6   Family Size             2000 non-null   int64
dtypes: int32(1), int64(5), object(1)
memory usage: 101.7+ KB